app/views/projects/_form.html.erb

  <%= f.input :description, label:'Description of project' %>
  Who needs for your project?  <%= f.collection_select :category_id, Developer.all, :id, :name, {promt: 'Choose category of developer'}, class: "btn-custom" %>
---
SELECT "developers".* FROM "developers"