app/views/projects/_projects_category.html.erb

        <li>
          <% Developer.all.each do |developer| %>
---
SELECT "developers".* FROM "developers"