app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "vdfbdbfdbdfbdbfdbbbfd"], ["project_id", 17], ["created_at", "2016-05-13 15:47:13.580495"], ["updated_at", "2016-05-13 15:47:13.580495"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2016-05-13 15:47:13.734920"], ["id", 1]]
---
  def create
    @comment = @project.comments.create(comment_params)
    @comment.user_id = current_user.id
    if @comment.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 18]]
---
  def find_project
    @project = Project.find(params[:project_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."project_id" = ? AND "comments"."id" = ? LIMIT 1  [["project_id", 18], ["id", 9]]
---
  def find_comment
    @comment = @project.comments.find(params[:id])