app/controllers/projects_controller.rb

  def index
    if params[:search]
      @projects = Project.search(params[:search]).order("created_at DESC")
    elsif params[:developer].blank?
      @projects = Project.all.order("created_at DESC")
    else
      @projects = Project.where(category_id: params[:developer]).order('created_at DESC')
---
SELECT "projects".* FROM "projects"  ORDER BY created_at DESC
SELECT "developers".* FROM "developers"
SELECT "projects".* FROM "projects" WHERE "projects"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 4]]

  def create
    @project = current_user.projects.build(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "description", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "JS"], ["description", "desc"], ["category_id", 1], ["user_id", 1], ["created_at", "2016-05-14 12:01:25.948045"], ["updated_at", "2016-05-14 12:01:25.948045"]]

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Title 23424"], ["description", "descfrgr"], ["updated_at", "2016-04-28 08:34:38.801250"], ["id", 13]]

  def find_project
    @project = Project.find(params[:id])
    @category = Developer.find(@project.category_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT 1  [["id", 14]]